Autodesk.Revit.DB.IModelExportContextProxy.OnPoint(Autodesk.Revit.DB.PointNode)
This method is called when a 3D Point is being output.
Remarks:
Note that this method is invoked only if the custom exporter
was set up to include geometric objects in the output stream.
See Autodesk::Revit::DB::CustomExporter::IncludeGeometricObjects for mode details.
node:
An output node that represents a Point.
Returns:
Return RenderNodeAction.Proceed if you wish to receive low-level geometry
(line segments) for this point, or otherwise return RenderNodeAction.Skip.
Since:
2016

Autodesk.Revit.DB.IModelExportContextProxy.OnPolyline(Autodesk.Revit.DB.PolylineNode)
This method is called when a 3D Polyline is being output.
Remarks:
Note that this method is invoked only if the custom exporter
was set up to include geometric objects in the output stream.
See Autodesk::Revit::DB::CustomExporter::IncludeGeometricObjects for mode details.
node:
An output node that represents a Polyline.
Returns:
Return RenderNodeAction.Proceed if you wish to receive tessellated geometry
(polyline segments) for this polyline, or otherwise return RenderNodeAction.Skip.
Since:
2016

Autodesk.Revit.DB.IModelExportContextProxy.OnCurve(Autodesk.Revit.DB.CurveNode)
This method is called when a 3D Curve is being output.
Remarks:
Note that this method is invoked only if the custom exporter
was set up to include geometric objects in the output stream.
See Autodesk::Revit::DB::CustomExporter::IncludeGeometricObjects for mode details.
The curve can be one of the geometric object that derive from the Curve class, e.g. Line, Arc,
NurbeSpline, etc. To get to the specific properties of the particular class, the curve
obtained from the input node first needs to be cast accordingly depending on the curve's
actual type.
node:
An output node that represents a Curve.
Returns:
Return RenderNodeAction.Proceed if you wish to receive tessellated geometry
(line or polyline segments) for this curve, or otherwise return RenderNodeAction.Skip.
Since:
2016